---
kind: property
id: P:Autodesk.Revit.DB.Options.ComputeReferences
source: html/d7da6de4-74a9-60e2-826f-698a5730d0a8.htm
---
# Autodesk.Revit.DB.Options.ComputeReferences Property

Determines whether or not references to geometric objects are computed.

## Syntax (C#)
```csharp
public bool ComputeReferences { get; set; }
```